#ifndef OPERACOESGRAFICAS_H_INCLUDED
    #define OPERACOESGRAFICAS_H_INCLUDED
#endif // OPERACOESGRAFICAS_H_INCLUDED
#define TAMANHO_MAXIMO_MATRIZ_COLUNAS 40
#define TAMANHO_MAXIMO_MATRIZ_LINHAS 20
#define	TAMANHO_MAXIMO_NOME 2
#define CARACTERE_DESENHO 1 //BONEQUINHO SORRINDO!
typedef enum _ENUM_TAMANHOS{
	ENUM_TAMANHO_IMAGEM_BACTERIAS = 24,
	ENUM_TAMANHO_IMAGEM_ROSTO = 34
} ENUM_TAMANHOS;
/*IMAGENS DISPONÍVEIS========================*/
#define IMAGEM_BACTERIAS
//#define IMAGEM_ROSTO
/*===========================================*/

/*Tipos================================================================*/

/*Prototipos===========================================================*/
static char sprite[TAMANHO_MAXIMO_MATRIZ_LINHAS][TAMANHO_MAXIMO_MATRIZ_COLUNAS] =
{
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
};

// ------------------ Dados da figura ----------------------------

// COLONIA DE BACTÉRIAS
#if defined(IMAGEM_BACTERIAS)
static float figura[][2] =
{
	{0,0},{1,0},{2,0},{3,0},{4,0},{5,0},{6,0},{7,0},
	{0,1},                                    {7,1},
	{0,2},                                    {7,2},
	{0,3},                                    {7,3},
	{0,4},                                    {7,4},
	{0,5},{1,5},{2,5},{3,5},{4,5},{5,5},{6,5},{7,5}
};
// Quantidade de pontos na figura:
static char qtd_pontos = ENUM_TAMANHO_IMAGEM_BACTERIAS;
#elif defined(IMAGEM_ROSTO)
//{linha,coluna}

static float figura[][2] =
{
	{0,0},{0,1},{0,2},{0,3},{0,4},{0,5},{0,6},{0,7},
	{1,0},                                    {1,7},
	{2,0},      {2,2},      {2,4},            {2,7},
	{3,0},                                    {3,7},
	{4,0},                                    {4,7},
	{5,0},      {5,2},{5,3},                  {5,7},
	{6,0},{6,1},{6,2},{6,3},{6,4},{6,5},{6,6},{6,7}
};
// Quantidade de pontos na figura:
static char qtd_pontos = ENUM_TAMANHO_IMAGEM_ROSTO;
#endif

// Eixo de rotação
static char rot_pos[2] = {3, 3};

// Posição da figura (linha - Y, coluna - X)
static char fig_pos[2] = {4, 14};

// escala 
static float scale = 1;

// ---------------------------------------------------------------

//[INICIO]OBSOLETA===========================================
//Função responsável por limpar a área de memória estrutura
void inicializaEstrutura(void);
//[FIM]OBSOLETA===========================================

void limpaSprite();

void desenhaNoSprite();

void movefigura();

void imprimeSprite();